# Importing Libraries

In [70]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

# Loading Dataset

In [71]:
df = pd.read_csv("data.csv")

In [72]:
df.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

# Basic Information

In [73]:
# Getting Columns of Dataset

df.columns

Index(['Country', 'Age', 'Salary', 'Purchased'], dtype='object')

In [74]:
# Getting Basic Information about Dataset

# help(pd.DataFrame.info)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 452.0+ bytes

In [75]:
# Getting DataTypes of Columns

df.dtypes

Country       object
Age          float64
Salary       float64
Purchased     object
dtype: object

#### describe()

In [76]:
# Getting Numerical Columns Statistics

# help(pd.DataFrame.describe)

df.describe()

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

In [77]:
# Getting Categorical Columns Description

df.describe(exclude='number')

       Country Purchased
count       10        10
unique       3         2
top     France        No
freq         4         5

#### loc & iloc

In [78]:
# Accessing Specific Rows and Columns

# help(pd.DataFrame.loc)
# For single row it returns Series
# For multiple rows returns a DataFrame

df.loc[0] # Label-based indexing

df.loc[0, ['Age']] # [RowStart:RowStop:RowStep, [Colum Names]]

Age    44.0
Name: 0, dtype: object

In [79]:
# Using iloc for fetching rows and columns

# help(pd.DataFrame.iloc)

df.iloc[:3, :2] # [RowStart:RowStop:RowStep, ColStart:ColStop:ColStep]

# df.iloc[:2, [ColIndex1, ColIndex1, ...]]

   Country   Age
0   France  44.0
1    Spain  27.0
2  Germany  30.0

#### select_dtypes(include=, exclude=)

In [80]:
# help(pd.DataFrame.select_dtypes)
# np.int64, np.float64, 'number', 'object', 'category'

df.select_dtypes(include='object')
# df.select_dtypes(include='number').columns

# df.select_dtypes(exclude='number')
# df.select_dtypes(exclude='number').columns

   Country Purchased
0   France        No
1    Spain       Yes
2  Germany        No
3    Spain        No
4  Germany       Yes
5   France       Yes
6    Spain        No
7   France       Yes
8  Germany        No
9   France       Yes

#### astype(dtype)

In [81]:
# Conversion od DataTypes

df['Country'] = df['Country'].apply(str)
df.dtypes

Country       object
Age          float64
Salary       float64
Purchased     object
dtype: object